src/Documents/КорректировкаДолга/КорректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаДолга</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <tabularSections>
    <name>Долги</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.ВидОплатыКонтрагента</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/КорректировкаДолга/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		// код ...	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатки ( Команда )
	
	контрагент = ПредопределенноеЗначение ( "Справочник.Контрагенты.ПустаяСсылка" );
	ПоказатьВводЗначения ( Новый ОписаниеОповещения ( "ВыборКонтрагента", ЭтотОбъект ), контрагент, "Выбор контрагента:", Новый ОписаниеТипов ( "СправочникСсылка.Контрагенты" ) );
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКонтрагента ( Контрагент, Парам ) Экспорт
	
	Если ( ЗначениеЗаполнено ( Контрагент ) ) Тогда
		заполнитьОстаткиПоКонтрагенту ( Контрагент );
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура заполнитьОстаткиПоКонтрагенту ( Контрагент )
	
	Объект.Долги.Очистить (); 
	с = "
	|выбрать Заявка как Заявка, Контрагент как Контрагент, ВидОплаты как ВидОплаты, 
	|	Валюта как Валюта, Организация как Организация, СуммаОстаток как Сумма 
	|из РегистрНакопления.Взаиморасчеты.Остатки ( &Период, Контрагент = &Контрагент и Организация = &Организация )    
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Период", ? ( Объект.Ссылка.Пустая (), ТекущаяДата (), Объект.Дата ) );
	запрос.УстановитьПараметр ( "Контрагент", Контрагент );
	запрос.УстановитьПараметр ( "Организация", Объект.Организация );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Пока ( выборка.Следующий () ) Цикл
		новаяСтрока = Объект.Долги.Добавить ();
		ЗаполнитьЗначенияСвойств ( новаяСтрока, выборка );
		Если ( выборка.Сумма < 0 ) Тогда
			новаяСтрока.Сумма = - 1 * новаяСтрока.Сумма;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры
